Repository: OpenELEC/unofficial-addons
Catalog: addons/system/truecrypt/source/resources/language/Slovak/strings.po
Languages: sk

# #50001
source: Mount
sk: Pripojiť

# #50002
source: Unmount
sk: Odpojiť

# #50003
source: Deactivate
sk: Deaktivovať

# #50004
source: Reset settings
sk: Vymazať nastavenia

# #50005
source: Recreate container
sk: Znovu vytvoriť súbor

# #50006
source: Format
sk: Formatovať

# #50007
source: Store password
sk: Uložiť heslo

# #50008
source: Remove stored password
sk: Vymazať uložené heslo

# #50009
source: Choose action:
sk: Vyberte činnost

# #50010
source: Passwords don't match.
sk: Heslo sa nezhoduje.

# #50011
source: Enter password
sk: Zadajte heslo

# #50013
source: Item is deactivated.
sk: Položka je deaktivovaná.

# #50014
source: Use Addon settings to re-activate it.
sk: V nastaveniach doplnku ju môžete aktivotať-

# #50015
source: Store password?
sk: Uložiť heslo?

# #50016
source: It is possible to store password for this file.
sk: Heslo pre tento súbor môže byž uložené.

# #50017
source: This way you won't need to specify it when mounting.
sk: Nebudete ho musieť uvázat pri pripojovaní.

# #50018
source: It's stored encoded, but be carefull when using this feature.
sk: Uloží sa kodovane, ale treba zachovávať opatrnosť!

# #50019
source: Continue?
sk: Pokračovať?

# #50020
source: Your current truecrypt file will be removed.
sk: Truecrypt súbor bude vymazaný.

# #50021
source: Enter size in MB.
sk: Zadajte veľkosť v MB.

# #50022
source: Creation of cantainer started.
sk: Vytvorenie kontainéru začaté.

# #50023
source: Attempting to mount created file.
sk: Pokus o pripojenie vytvoreného súboru.

# #50024
source: All settings for selected item will be removed.
sk: Všetky nastavenia pre položku budú vymazané

# #50025
source: Select file system:
sk: Vyberte systém súborov:

# #50027
source: Formatting
sk: Formatovanie

# #50028
source: Container will be formated with FAT32 by default.
sk: Predvolený system súborov je FAT32.

# #50029
source: Would you like to choose other file system?
sk: Chcete vybrať iný systém súborov?

# #50030
source: Truecrypt error
sk: Truecrypt chyba

# #50031
source: Failed to mount file.
sk: Pripojenie zlyhalo.

# #50032
source: Not proceeding with formatting.
sk: Nepokračujem s formátovaním.

# #50033
source: Starting formatting.
sk: Začínam formatovať

# #50034
source: Formating completed.
sk: Formátovanie ukončené

# #50035
source: Failed to format drive.
sk: Formátovanie sa nepodarilo.

# #50036
source: All files in your container will be removed!
sk: Všetky súbory v kontainery budú odstránené.

# #50037
source: Container mounted successfully after formatting.
sk: Kontainer úspešne pripojený po formátovaní.

# #50038
source: Failed to mount file after formatting.
sk: Nepodarilo sa pripojiť po formátovaní.

# #50039
source: Select item:
sk: Vyberte položku:

# #50040
source: Tasks:
sk: Úlohy:

# #50041
source: Create new Truecrypt volume
sk: Vytvoriť nový Truecrypt súbor

# #50042
source: Assign existing TrueCrypt file
sk: Priradiť existujúci TrueCrypt súbor

# #50043
source: Display name
sk: Zobrazovacie meno

# #50044
source: Select folder for new file
sk: Vyberte adresár pre nový súbor

# #50045
source: Select file
sk: Vyberte súbor

# #50046
source: Select mount point/drive
sk: Vyberte prípojný bod/jednotku

# #50047
source: Select icon (optional)
sk: Vyberte ikonu (nepovynné)

# #50048
source: The truecrypt drive is mounted.
sk: Truecrypt jednotka je pripojená.

# #50049
source: The truecrypt drive failed to mount.
sk: Nepodarilo sa pripojit jednotku Truecrypt

# #50050
source: The truecrypt drive is unmounted.
sk: Truecrypt jednotka je odpojená.

# #50051
source: Select item:
sk: Vyberte položku:

# #50052
source: assigned file
sk: priradený súbor

# #50053
source: Creation of container started.
sk: Vytvorenie kontainera začaté.

# #50054
source: Attempting to mount created file.
sk: Pokus o pripojenie vytvoreného súboru.

# #50055
source: The truecrypt drive failed to unmount.
sk: Nepodarilo sa odpojiť jednotku truecrypt

# #50056
source: mounted
sk: pripojené

# #50057
source: File deleted sucessfully.
sk: Súbor vymazaný

# #50058
source: Failed
sk: Neuspečné

# #50059
source: Failed to delete specified file.
sk: Nepodarilo sa vymazať súbor.

# #50060
source: Item
sk: Polozka

# #50061
source: Failed to format truecrypt drive.
sk: Nepodarilo sa naformatovať jednotku truecrypt.

# #50062
source: Formatting was successfull
sk: Formatovanie úspešne ukončené.

# #50063
source: Container created sucessfully
sk: Kontainer úspešne vytvorený.

# #50064
source: locked
sk: zamknuté

# #50065
source: No action available as item is locked.
sk: Úlohy nedostupné pretože položka je zamknutá.

# #50066
source: Change password
sk: Zmeniť heslo

# #50067
source: Password changed sucessfully.
sk: Heslo úspešne zmenené.

# #50068
source: Failed to change pasword.
sk: Heslo sa nepodarilo zmeniť.

# #50069
source: Delete file?
sk: Vymazať súbor?

# #50070
source: Wrong/Missing Setting
sk: Nesprávne/chýbajúce nastavenie

# #50071
source: The Setting for the Truecrypt script is wrong or missing.
sk: Nastavenie Truecrypt scriptu je nesprávne alebo chýba.

# #50072
source: The Setting for the TC File/partition is wrong or missing.
sk: Nastavenie TC súboru / oddielu chýba alebo je nesprávne.

# #50073
source: No mount point was specified or it doesn't exists.
sk: Prípojný bod nie je špecifikovaný alebo neexistuje.

# #50074
source: Allow unsafe operations
sk: Povoliť nebezpečné úlohy

# #50075
source: Perform mount checks (off disables some actions)
sk: Povolit kontroly priponjenia (vypnuté vypne niektore úlohy)

# #50076
source: Create mount folder if not exists
sk: Vytvoriť adresár pre prípojný bod ak neexistuje

# #50077
source: Debugging mode
sk: Ladenie

# #50078
source: - show password in log
sk: - zobraziť heslo v logu

# #50079
source: Truecrypt file
sk: Súbor truecrypt

# #50080
source: Mount point / drive
sk: Prípojný bod / zariadenie

# #50081
source: Optional settings:
sk: Volitelné nastavenia:

# #50082
source: Password
sk: Heslo

# #50083
source: Icon
sk: Ikona

# #50084
source: Use key file(s)
sk: Používať súbor(y) kľúča

# #50085
source: Key file(s)
sk: Kľúčový súbor

# #50086
source: Name
sk: Názov

# #50087
source: Create key file
sk: Vytvoriť súbor použiteľný ako kľúč

# #50088
source: Failed to create key file.
sk: Nepodarilo sa vytvoriť súbor kľúca.

# #50089
source: Check XBMC log for details.
sk: Detaily sa nachádzajú XBMC logu.

# #50090
source: Enable debug mode in plugin settings and run the task again for details.
sk: Zapnite mód ladenia v nastaveniach doplnku a znova spuste úlohu pre zobrazenie detailov.

# #50091
source: Key file created successfuly.
sk: Súbor použiteľný ako kľúč je úspešne vytvorený.

# #50092
source: Select key file no.
sk: Vyberte súbor kľuča č.

# #50093
source: - number of key files (-1 means always ask for it)
sk: - počet súborov kľúča (-1 znamená vždy sa spýtať)

# #50094
source: - show key files in log
sk: - zobraziť súbory kľuča v logu

# #50095
source: Are key file(s) used?
sk: Používajú sa súbory kľúča?

# #50096
source: Would you like to store key files number?
sk: Prajete si uložiť počet súborov kľúča?

# #50097
source: Otherwise it will always ask for it.
sk: Ináč sa bude stále pýtať na to.

# #50098
source: Would you like to use key file(s)?
sk: Prajete si použoť súbory kľúča?

# #50099
source: Add key file(s)
sk: Pridať súbor(y) kľúča

# #50100
source: Remove key file(s)
sk: Odobrať súbor(y) kľúča

# #50101
source: Change key files(s)
sk: Zmeniť súbor(y) kľúča

# #50102
source: Store key file(s) path
sk: Uložiť cesku k súboru(om) kľúča

# #50103
source: Remove stored key file(s) path
sk: Odstrámiť uloženú cesku k súboru(om) kľúča

# #50104
source: Drive has to be unmounted first.
sk: Zariadenie musí byť najprv odpojené.

# #50105
source: Proceed?
sk: Pokračovať?

# #50106
source: Key file(s) modified successfully.
sk: Súbor(y) kľúča sú úspešne pozmenené.

# #50107
source: Failed to modify key file(s).
sk: Nepodarilo sa pozmeniť súbor(y) kľúča.

# #50108
source: Please provide information concerning old key file(s).
sk: Prosím zadajte informácie o starých súboroch kľúča.

# #50109
source: Please provide information concerning new key file(s).
sk: Prosím zadajte informácie o nových súboroch kľúča.

# #50110
source: Allow password or key files manipulation.
sk: Povoliť zmeny v hesla a v súboroch kľúča.

# #50111
source: Tasks settings
sk: Nastavenie úloh

# #50112
source: Debugging
sk: Ladenie

# #50113
source: Store path to the key file(s)?
sk: Uložiť cestu k súboru(om) kľúča?

# #50114
source: It is possible to key files path for this file.
sk: Je možné uložiť cestu k súboru(om) kľúča pre tento súbor.

# #50115
source: Remove stored key file(s) path
sk: Odstrániť uloženú cestu k súboru(om) kľúča

# #50116
source: Remove also stored number of key files?
sk: Odstrániť tiež uložený počet súborov kľúča?

# #50117
source: Use alternative shell script
sk: Použiť alternatívny shell script

# #50118
source: Alternative shell script
sk: Alternatívny shell script

# #50119
source: Debugging and development
sk: Ladenie a vývoj

# #50120
source: New file creation
sk: Vytvorenie nového súboru

# #50121
source: Random number generator
sk: Generátor náhodných čísel

# #50122
source: changing password or key file(s)
sk: menenie hesla alebo súboru(ov) kľúča

# #50123
source: new file creation
sk: Vytvorenie nového súboru

# #50124
source: Enter password for outer volume
sk: Zadajte heslo vonkajšieho zväzku

# #50125
source: Enter password for hidden volume
sk: Zadajte heslo skrýtého zväzku

# #50126
source: Select number of key files for outer volume
sk: Zadajte počet súborv kľúča vonkajšieho zväzku

# #50127
source: Select number of key files for hidden volume
sk: Zadajte počet súborv kľúča skrýtého zväzku

# #50128
source: Size of hidden volume is bigger or the same as size of outer volume.
sk: Skritý zväzkok je väčší/rovnaký ako vonkajší zväzok.

# #50129
source: Enter size of outer volume in MB
sk: Zadajte velkosť vonkajšieho zväzku v MB

# #50130
source: Enter size of hiden volume in MB
sk: Zadajte velkosť skrytého zväzku v MB

# #50131
source: Creation process failed.
sk: Proces vytvorenia zlihal.

# #50132
source: Volume created successfuly.
sk: Zväzok úspešne vytvorený.

# #50133
source: Add volume to the list?
sk: Pridať zväzok do zoznamu?

# #50134
source: Create container with hidden volume
sk: Vytvoriť kontainer so skrytým zväzkom

# #50135
source: Enter old password
sk: Zadajte staré heslo

# #50136
source: Enter new password
sk: Zadajte nové heslo

# #50137
source: Enter number of new key files
sk: Zadajte počet nových súborov kľúča

# #50138
source: Enter number of old key files
sk: Zadajte počet starých súborov kľúča

# #50139
source: Enter password for outer volume
sk: Zadajte heslo vonkajšieho zväzku

# #50140
source: Re-enter password for outer volume
sk: Znovu zadajte heslo vonkajšieho zväzku

# #50141
source: Enter enter password for hidden volume
sk: Zadajte heslo skrýtého zväzku

# #50142
source: Re-enter password for hidden volume
sk: Znovu zadajte heslo skrýtého zväzk

# #50143
source: mount point in use
sk: prípojný bod sa používa

# #50144
source: Actions not available as mount point is in use.
sk: Úlohy sú nedostupné lebo prípojný bod sa používa.

# #50146
source: Enter password for
sk: Zadajte heslo pre

# #50148
source: Choose partition
sk: Vyberte diskový oddiel

# #50149
source: Choose type
sk: Vyberte typ

# #50150
source: TrueCrypt file
sk: TrueCrypt súbor

# #50151
source: Partition
sk: Diskový oddiel

# #50152
source: No action available as mount point is in use.
sk: Úlohy sú nedostupné lebo prípojný bod sa používa.

# #50153
source: Mount at start up
sk: Pripojiť pri štarte

# #50154
source: Turn off mounting at start up
sk: Vypnuť pripojenie pri štarte

# #50155
source: Mount with hidden volume protection
sk: Pripojiť s ochranou skrytého zväzku

# #50156
source: Choose file to dismount
sk: Vyberte súbor na odpojenie

# #50157
source: To add files to outer volume, use hidden volume protection.
sk: Pridávajte súbory do vonk. zväzku iba s ochranou skr. zväzku.

# #50158
source: Otherwise you may destroy hidden volume.
sk: Ináč možete zničiť skrytý zväzok.

# #50159
source: Failed to create new volume.
sk: Nepodarilo sa vytvorit nový zväzok.

# #50160
source: Drive may not be connected.
sk: Zariadenie nemusí byť pripojené.

# #50161
source: Volume
sk: Zväzok

# #50162
source: TrueCrypt file with hidden volume
sk: TrueCrypt súbor so skrytým zväzkom

# #50163
source: Choose volume type
sk: Vyberte typ zväzku

# #50164
source: Select number of key files
sk: Vyberte počet súborov kľúča

# #50165
source: No volume is mounted.
sk: Nie je pripojený žiaden zväzok.

# #50166
source: Don't store any information
sk: Neukladať žiadné informácie

# #50167
source: Allow storing password and key file paths (can be security breach)
sk: Povoliť ukladanie hesiel a cesty k súborom kľúča (možnosť narušenia bezpečnosti)

# #50168
source: Store information about key file usage (can be security breach)
sk: Ukladať informáciu o použití súborov kľúča (možnosť narušenia bezpečnosti)

# #50169
source: Security
sk: Bezpečnosť

# #50170
source: Not proceeding with unmout.
sk: Nepokračujem s odpojením.

# #50171
source: Volume is locked by other internal process.
sk: Zväzok je uzamknutý iným interným procesom.

# #50172
source: Failed to mount/unmount after volume creation.
sk: Nepodarilo sa pripojit/odpojit zväzok po vytvorení.
